# for using bundle / Brewfile
tap "homebrew/bundle"
# for dupes (ex: grep)
tap "homebrew/dupes"
# enable cask
tap "caskroom/cask"
# enable alternative versions
tap "caskroom/versions"
# enable cask fonts
tap "caskroom/fonts"
# enable cask upgrade command
tap "buo/cask-upgrade"

# zsh shell
brew "zsh"

# GNU utils - note: I don't want to override system binaries, so just skip with-default-names option.
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "coreutils"
brew "binutils"
brew "diffutils"

# tmux
brew "tmux"

# system utils
brew "gzip"
brew "watch"
brew "wget"
brew "nmap"
brew "htop"
brew "gpg"
brew "git"

# Vim
brew "vim"

# Hugo for blog
brew "hugo"

# casks for macos utility
cask "iterm2"
cask "google-chrome"
cask "spectacle"

# Development Tools
cask "github-desktop"
cask "visual-studio-code"
cask "firefoxdeveloperedition"
cask "java"

# Jetbrains Toolbox
cask "jetbrains-toolbox"

# fonts
cask "font-nanumgothic"
cask "font-nanumgothiccoding"
cask "font-d2coding"
cask "font-noto-sans-cjk"
cask "font-awesome-terminal-fonts"

# Ruby
brew "rbenv"
brew "ruby-build"

# Python
brew "pyenv"
brew "pyenv-virtualenv"

# MAS (mac app store cli interface)
brew "mas"
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Kobito - Markdown メモアプリ", id: 896624060
mas "The Unarchiver", id: 425424353
mas "Bee - Issue Tracking made Native", id: 726099620
mas "Airmail 3", id: 918858936
